nodejs/logs/express/test1.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        64 bytes

Concurrency Level:      100
Time taken for tests:   0.411 seconds
Complete requests:      500
Failed requests:        41
   (Connect: 0, Receive: 0, Length: 41, Exceptions: 0)
Total transferred:      135456 bytes
HTML transferred:       31956 bytes
Requests per second:    1216.91 [#/sec] (mean)
Time per request:       82.176 [ms] (mean)
Time per request:       0.822 [ms] (mean, across all concurrent requests)
Transfer rate:          321.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   2.7      4      11
Processing:     4   72  22.3     72     116
Waiting:        3   45  18.4     47      84
Total:         14   76  20.9     73     116

Percentage of the requests served within a certain time (ms)
  50%     73
  66%     86
  75%     87
  80%     94
  90%    115
  95%    115
  98%    116
  99%    116
  100%   116 (longest request)