nodejs/logs/express/test2.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        64 bytes

Concurrency Level:      100
Time taken for tests:   6.441 seconds
Complete requests:      10000
Failed requests:        993
   (Connect: 0, Receive: 0, Length: 993, Exceptions: 0)
Total transferred:      2708897 bytes
HTML transferred:       638897 bytes
Requests per second:    1552.45 [#/sec] (mean)
Time per request:       64.414 [ms] (mean)
Time per request:       0.644 [ms] (mean, across all concurrent requests)
Transfer rate:          410.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.0      2      10
Processing:     9   62   7.8     62      97
Waiting:        1   48   9.4     48      92
Total:          9   64   7.8     64      98

Percentage of the requests served within a certain time (ms)
  50%     64
  66%     66
  75%     68
  80%     70
  90%     74
  95%     80
  98%     84
  99%     86
 100%     98 (longest request)